"use client";

import DashboardButton from "@/components/dashboard_button";
import { Button } from "@/components/ui/button";
import { useAuth } from "@/contexts/authContext";
import { useController } from "@/contexts/controllerContext";
import { useSocket } from "@/contexts/socketContext";
import useLoading from "@/hooks/useLoading";
import { useSocketRequest } from "@/hooks/useSocketRequest";
import { Webhook, Wifi, WifiHigh, WifiLow } from "lucide-react";
import { usePathname, useRouter } from "next/navigation"; // Import usePathname
import { ReactNode, useCallback, useEffect, useState } from "react";
import { BsArrowLeft } from "react-icons/bs";
import { ScrollArea } from "./ui/scroll-area";
import Image from "next/image";
import { MainLayoutBody, MainLayoutHeader } from "./common/main_layout";

export default function MainLayout({
  children,
}: Readonly<{ children: ReactNode }>) {
  const buttons: {
    hover_icon: ReactNode;
    out_icon: ReactNode;
    text: string;
    href: string;
  }[] = [
    {
      hover_icon: (
        <svg
          width="45"
          height="44"
          viewBox="0 0 45 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clipPath="url(#clip0_65_461)">
            <path
              d="M44.2082 21.9932C44.2082 34.0249 34.2113 43.9865 22.1022 43.9865C10.0146 43.9865 0 34.0249 0 21.9932C0 9.94398 9.99708 0 22.0847 0C34.1935 0 44.2082 9.94398 44.2082 21.9932ZM21.4175 13.9471L11.9686 21.8319V30.4659C11.9686 32.0492 12.9837 33.0303 14.662 33.0303H29.589C31.2558 33.0303 32.261 32.0492 32.261 30.4659V21.8493L22.8121 13.9471C22.3627 13.5639 21.8668 13.5814 21.4175 13.9471ZM25.0845 23.6794V30.682H19.1588V23.6794C19.1588 23.151 19.505 22.7967 20.0498 22.7967H24.1973C24.7674 22.7967 25.0845 23.151 25.0845 23.6794ZM20.4384 9.63564L8.70213 19.4089C8.42825 19.6661 8.2729 20.0063 8.2729 20.3214C8.2729 20.9206 8.71582 21.4545 9.44846 21.4545C9.83146 21.4545 10.1267 21.2455 10.4105 21.0096L21.554 11.712C21.9508 11.3811 22.3141 11.416 22.6971 11.712L33.8193 21.0096C34.1206 21.2455 34.4157 21.4545 34.7812 21.4545C35.4437 21.4545 35.9567 21.0117 35.9567 20.3602C35.9567 19.9714 35.8188 19.6622 35.5314 19.405L32.2919 16.7236V12.1229C32.2919 11.6332 31.9749 11.2964 31.465 11.2964H29.9775C29.4854 11.2964 29.1256 11.6332 29.1256 12.1229V14.0622L23.8303 9.63564C22.8018 8.76908 21.4492 8.76908 20.4384 9.63564Z"
              fill="#FFFFFF"
              fillOpacity="0.85"
            />
          </g>
          <defs>
            <rect width="45" height="44" fill="white" />
          </defs>
        </svg>
      ),
      out_icon: (
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="45"
          height="44"
          viewBox="0 0 45 44"
          fill="none"
        >
          <path
            d="M44.2082 21.9932C44.2082 34.0249 34.2113 43.9865 22.1022 43.9865C10.0146 43.9865 0 34.0249 0 21.9932C0 9.94398 9.99708 0 22.0847 0C34.1935 0 44.2082 9.94398 44.2082 21.9932ZM21.4175 13.9471L11.9686 21.8319V30.4659C11.9686 32.0492 12.9837 33.0303 14.662 33.0303H29.589C31.2558 33.0303 32.261 32.0492 32.261 30.4659V21.8493L22.8121 13.9471C22.3627 13.5639 21.8668 13.5814 21.4175 13.9471ZM25.0845 23.6794V30.682H19.1588V23.6794C19.1588 23.151 19.505 22.7967 20.0498 22.7967H24.1973C24.7674 22.7967 25.0845 23.151 25.0845 23.6794ZM20.4384 9.63564L8.70213 19.4089C8.42825 19.6661 8.2729 20.0063 8.2729 20.3214C8.2729 20.9206 8.71582 21.4545 9.44846 21.4545C9.83146 21.4545 10.1267 21.2455 10.4105 21.0096L21.554 11.712C21.9508 11.3811 22.3141 11.416 22.6971 11.712L33.8193 21.0096C34.1206 21.2455 34.4157 21.4545 34.7812 21.4545C35.4437 21.4545 35.9567 21.0117 35.9567 20.3602C35.9567 19.9714 35.8188 19.6622 35.5314 19.405L32.2919 16.7236V12.1229C32.2919 11.6332 31.9749 11.2964 31.465 11.2964H29.9775C29.4854 11.2964 29.1256 11.6332 29.1256 12.1229V14.0622L23.8303 9.63564C22.8018 8.76908 21.4492 8.76908 20.4384 9.63564Z"
            fill="#6611DD"
            fillOpacity="0.85"
          />
        </svg>
      ),
      text: "داشبورد",
      href: "/dashboard",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M43.2257 21.9932C43.2257 34.0249 33.451 43.9865 21.6111 43.9865C9.79208 43.9865 0 34.0249 0 21.9932C0 9.94398 9.77492 0 21.5939 0C33.4337 0 43.2257 9.94398 43.2257 21.9932ZM15.2928 14.505V29.4798C15.2928 30.7897 16.6505 31.3827 17.8318 30.6619L29.8981 23.4252C30.9747 22.7644 30.9537 21.234 29.8981 20.5982L17.8318 13.3268C16.7116 12.6505 15.2928 13.2126 15.2928 14.505Z"
            fill="white"
            fillOpacity="0.85"
          />
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clipPath="url(#clip0_3_55)">
            <path
              d="M43.2257 21.9932C43.2257 34.0249 33.451 43.9865 21.6111 43.9865C9.79208 43.9865 0 34.0249 0 21.9932C0 9.94398 9.77492 0 21.5939 0C33.4337 0 43.2257 9.94398 43.2257 21.9932ZM15.2928 14.505V29.4798C15.2928 30.7897 16.6505 31.3827 17.8318 30.6619L29.8981 23.4252C30.9747 22.7644 30.9537 21.234 29.8981 20.5982L17.8318 13.3268C16.7116 12.6505 15.2928 13.2126 15.2928 14.505Z"
              fill="#6611DD"
              fillOpacity="0.85"
            />
          </g>
          <defs>
            <clipPath id="clip0_3_55">
              <rect width="44" height="44" fill="white" />
            </clipPath>
          </defs>
        </svg>
      ),
      text: "مدیریت دوره ها",
      href: "/dashboard/management_of_courses",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clipPath="url(#clip0_65_555)">
            <path
              d="M43.2162 21.5217C43.2162 33.2837 33.4291 43.0222 21.6081 43.0222C9.80837 43.0222 0 33.2837 0 21.5217C0 9.78067 9.7872 0.0210724 21.5869 0.0210724C33.4078 0.0210724 43.2162 9.78067 43.2162 21.5217ZM10.338 31.1969C10.338 31.9979 10.7405 32.5671 11.6302 32.5671H31.5858C32.4757 32.5671 32.8781 31.9979 32.8781 31.1969C32.8781 28.8362 29.2769 22.6599 21.6081 22.6599C13.9393 22.6599 10.338 28.8362 10.338 31.1969ZM15.9942 14.7553C15.9942 18.2544 18.5152 20.8472 21.6081 20.8682C24.701 20.8893 27.2219 18.2544 27.2219 14.7553C27.2219 11.5091 24.701 8.81103 21.6081 8.81103C18.5152 8.81103 15.9942 11.5091 15.9942 14.7553Z"
              fill="white"
              fillOpacity="0.85"
            />
          </g>
          <defs>
            <clipPath id="clip0_65_555">
              <rect width="44" height="43.0222" fill="white" />
            </clipPath>
          </defs>
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clipPath="url(#clip0_65_555)">
            <path
              d="M43.2162 21.5217C43.2162 33.2837 33.4291 43.0222 21.6081 43.0222C9.80837 43.0222 0 33.2837 0 21.5217C0 9.78067 9.7872 0.0210724 21.5869 0.0210724C33.4078 0.0210724 43.2162 9.78067 43.2162 21.5217ZM10.338 31.1969C10.338 31.9979 10.7405 32.5671 11.6302 32.5671H31.5858C32.4757 32.5671 32.8781 31.9979 32.8781 31.1969C32.8781 28.8362 29.2769 22.6599 21.6081 22.6599C13.9393 22.6599 10.338 28.8362 10.338 31.1969ZM15.9942 14.7553C15.9942 18.2544 18.5152 20.8472 21.6081 20.8682C24.701 20.8893 27.2219 18.2544 27.2219 14.7553C27.2219 11.5091 24.701 8.81103 21.6081 8.81103C18.5152 8.81103 15.9942 11.5091 15.9942 14.7553Z"
              fill="#7D35E2"
            />
          </g>
          <defs>
            <clipPath id="clip0_65_555">
              <rect width="44" height="43.0222" fill="white" />
            </clipPath>
          </defs>
        </svg>
      ),
      text: "مدیریت کاربران",
      href: "/dashboard/management_users",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22" cy="22" r="22" fill="white" fillOpacity="0.85" />
          <path
            d="M22.1203 24.92H16.9203L15.8803 28H12.9203L18.2003 13.78H20.8003L26.1203 28H23.1603L22.1203 24.92ZM17.6403 22.72H21.4003L19.5003 17.1L17.6403 22.72ZM30.4992 28H27.6992V13.78H30.4992V28Z"
            fill="#7D35E2"
          />
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22" cy="22" r="22" fill="#6611DD" fillOpacity="0.85" />
          <path
            d="M22.1203 24.92H16.9203L15.8803 28H12.9203L18.2003 13.78H20.8003L26.1203 28H23.1603L22.1203 24.92ZM17.6403 22.72H21.4003L19.5003 17.1L17.6403 22.72ZM30.4992 28H27.6992V13.78H30.4992V28Z"
            fill="white"
          />
        </svg>
      ),
      text: "پشتیبانی",
      href: "/dashboard/support",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22" cy="22" r="22" fill="white" fillOpacity="0.85" />
          <path
            d="M21.9844 32C17.125 30.2188 14.4531 27.0469 13.9688 22.5C13.7969 21.1094 13.7188 19.7656 13.7188 18.4375L13.7656 15.125C17.1875 15.125 19.9219 14.0781 21.9688 12C24.0469 14.0781 26.7969 15.125 30.2031 15.125L30.2812 18.4375C30.2812 19.7656 30.1875 21.2656 30 22.9375C29.8125 24.6094 29.125 26.2812 27.9375 27.9531C26.7656 29.6406 24.7656 30.9844 21.9844 32Z"
            fill="#6611DD"
          />
          <path
            d="M19.9219 26.2344C19.9687 26.2344 21.9531 24.8594 25.8906 22.125C25.9531 22.0781 25.9844 22.0313 25.9844 21.9844C25.9844 21.9063 25.9531 21.8438 25.8906 21.7969C21.9688 19.0781 19.9687 17.7188 19.9219 17.7188C19.7812 17.7188 19.7188 17.7813 19.7188 17.9219V26.0313C19.7188 26.1719 19.7969 26.2344 19.9219 26.2344Z"
            fill="white"
          />
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22" cy="22" r="22" fill="#6611DD" fillOpacity="0.85" />
          <path
            d="M21.9844 32C17.125 30.2188 14.4531 27.0469 13.9688 22.5C13.7969 21.1094 13.7188 19.7656 13.7188 18.4375L13.7656 15.125C17.1875 15.125 19.9219 14.0781 21.9688 12C24.0469 14.0781 26.7969 15.125 30.2031 15.125L30.2812 18.4375C30.2812 19.7656 30.1875 21.2656 30 22.9375C29.8125 24.6094 29.125 26.2812 27.9375 27.9531C26.7656 29.6406 24.7656 30.9844 21.9844 32Z"
            fill="white"
          />
          <path
            d="M19.9219 26.2344C19.9687 26.2344 21.9531 24.8594 25.8906 22.125C25.9531 22.0781 25.9844 22.0313 25.9844 21.9844C25.9844 21.9063 25.9531 21.8438 25.8906 21.7969C21.9688 19.0781 19.9687 17.7188 19.9219 17.7188C19.7812 17.7188 19.7188 17.7813 19.7188 17.9219V26.0313C19.7188 26.1719 19.7969 26.2344 19.9219 26.2344Z"
            fill="#7D35E2"
          />
        </svg>
      ),
      href: "/dashboard/license",
      text: "لایسنس",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clipPath="url(#clip0_418_1535)">
            <path
              d="M43.2258 21.6432C43.2258 33.4832 33.451 43.2581 21.6111 43.2581C9.79208 43.2581 0 33.4832 0 21.6432C0 9.82431 9.77493 0.0322189 21.5939 0.0322189C33.4337 0.0322189 43.2258 9.82431 43.2258 21.6432ZM16.4543 32.1665C16.4543 33.2768 17.3385 34.1325 18.4243 34.1325C19.531 34.1325 20.4076 33.2768 20.4076 32.1665C20.4076 31.0424 19.531 30.1792 18.4243 30.1792C17.3385 30.1792 16.4543 31.0424 16.4543 32.1665ZM25.8388 32.1665C25.8388 33.2768 26.7497 34.1325 27.8432 34.1325C28.9461 34.1325 29.8266 33.2768 29.8266 32.1665C29.8266 31.0424 28.9461 30.1792 27.8432 30.1792C26.7497 30.1792 25.8388 31.0424 25.8388 32.1665ZM9.88663 12.3047C9.17573 12.3047 8.6552 12.8215 8.6552 13.5571C8.6552 14.2718 9.17573 14.7885 9.88663 14.7885H13.0872L14.7141 26.1679C14.9689 27.8985 16.0798 28.8205 17.9954 28.8205H29.5967C30.2889 28.8205 30.7735 28.3661 30.7735 27.6172C30.7735 26.91 30.2889 26.4481 29.5967 26.4481H18.1351C17.5694 26.4481 17.179 26.107 17.1066 25.5204L17.0192 24.7083H30.065C31.7022 24.7083 32.5521 23.7346 32.7899 22.1241L33.5836 16.6577C33.6254 16.5208 33.6464 16.3325 33.6464 16.23C33.6464 15.6317 33.2396 15.1986 32.5028 15.1986H15.6078L15.4308 13.9057C15.2865 12.9399 14.5387 12.3047 13.4763 12.3047H9.88663Z"
              fill="white"
              fillOpacity="0.85"
            />
          </g>
          <defs>
            <clipPath id="clip0_418_1535">
              <rect width="44" height="43.2581" fill="white" />
            </clipPath>
          </defs>
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g clipPath="url(#clip0_418_1344)">
            <path
              d="M43.2258 21.6432C43.2258 33.4832 33.451 43.2581 21.6111 43.2581C9.79208 43.2581 0 33.4832 0 21.6432C0 9.82431 9.77493 0.0322189 21.5939 0.0322189C33.4337 0.0322189 43.2258 9.82431 43.2258 21.6432ZM16.4543 32.1665C16.4543 33.2768 17.3385 34.1325 18.4243 34.1325C19.531 34.1325 20.4076 33.2768 20.4076 32.1665C20.4076 31.0424 19.531 30.1792 18.4243 30.1792C17.3385 30.1792 16.4543 31.0424 16.4543 32.1665ZM25.8388 32.1665C25.8388 33.2768 26.7497 34.1325 27.8432 34.1325C28.9461 34.1325 29.8266 33.2768 29.8266 32.1665C29.8266 31.0424 28.9461 30.1792 27.8432 30.1792C26.7497 30.1792 25.8388 31.0424 25.8388 32.1665ZM9.88663 12.3047C9.17573 12.3047 8.6552 12.8215 8.6552 13.5571C8.6552 14.2718 9.17573 14.7885 9.88663 14.7885H13.0872L14.7141 26.1679C14.9689 27.8985 16.0798 28.8205 17.9954 28.8205H29.5967C30.2889 28.8205 30.7735 28.3661 30.7735 27.6172C30.7735 26.91 30.2889 26.4481 29.5967 26.4481H18.1351C17.5694 26.4481 17.179 26.107 17.1066 25.5204L17.0192 24.7083H30.065C31.7022 24.7083 32.5521 23.7346 32.7899 22.1241L33.5836 16.6577C33.6254 16.5208 33.6464 16.3325 33.6464 16.23C33.6464 15.6317 33.2396 15.1986 32.5028 15.1986H15.6078L15.4308 13.9057C15.2865 12.9399 14.5387 12.3047 13.4763 12.3047H9.88663Z"
              fill="#6611DD"
              fillOpacity="0.85"
            />
          </g>
          <defs>
            <clipPath id="clip0_418_1344">
              <rect width="44" height="43.2581" fill="white" />
            </clipPath>
          </defs>
        </svg>
      ),
      href: "/dashboard/finance_settings",
      text: "تنظیمات مالی",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22" cy="22" r="22" fill="white" fillOpacity="0.85" />
          <g clipPath="url(#clip0_436_494)">
            <path
              d="M13 25.3379C13 26.627 14.0547 27.6816 15.3438 27.6816C16.6328 27.6816 17.6973 26.627 17.6973 25.3379C17.6973 24.0488 16.6328 22.9941 15.3438 22.9941C14.0547 22.9941 13 24.0488 13 25.3379ZM14.2012 25.3379C14.2012 24.6934 14.709 24.1953 15.3535 24.1953C15.998 24.1953 16.4961 24.6934 16.4961 25.3379C16.4961 25.9824 15.998 26.4805 15.3535 26.4805C14.709 26.4805 14.2012 25.9824 14.2012 25.3379ZM15.3535 14C14.9141 14 14.5625 14.3516 14.5625 14.791V23.7852H16.1348V14.791C16.1348 14.3516 15.793 14 15.3535 14ZM15.3535 31.1875C15.793 31.1875 16.1348 30.8359 16.1348 30.4355V27.0371H14.5625V30.4355C14.5625 30.8359 14.9141 31.1875 15.3535 31.1875ZM19.582 19.6934C19.582 20.9824 20.6465 22.0371 21.9355 22.0371C23.2246 22.0371 24.2793 20.9824 24.2793 19.6934C24.2793 18.4043 23.2246 17.3496 21.9355 17.3496C20.6465 17.3496 19.582 18.4043 19.582 19.6934ZM20.793 19.6934C20.793 19.0586 21.3008 18.5508 21.9355 18.5508C22.5801 18.5508 23.0781 19.0586 23.0781 19.6934C23.0781 20.3379 22.5801 20.8359 21.9355 20.8359C21.3008 20.8359 20.793 20.3379 20.793 19.6934ZM21.9355 14C21.4961 14 21.1543 14.3516 21.1543 14.752V18.0137H22.7266V14.752C22.7266 14.3516 22.375 14 21.9355 14ZM21.9355 31.1875C22.375 31.1875 22.7266 30.8359 22.7266 30.3965V21.2461H21.1543V30.3965C21.1543 30.8359 21.4961 31.1875 21.9355 31.1875ZM26.1836 25.3379C26.1836 26.627 27.2383 27.6816 28.5273 27.6816C29.8164 27.6816 30.8711 26.627 30.8711 25.3379C30.8711 24.0488 29.8164 22.9941 28.5273 22.9941C27.2383 22.9941 26.1836 24.0488 26.1836 25.3379ZM27.3848 25.3379C27.3848 24.6934 27.8926 24.1953 28.5273 24.1953C29.1816 24.1953 29.6699 24.6934 29.6699 25.3379C29.6699 25.9824 29.1816 26.4805 28.5273 26.4805C27.8926 26.4805 27.3848 25.9824 27.3848 25.3379ZM28.5273 14C28.0879 14 27.7363 14.3516 27.7363 14.791V23.834H29.3086V14.791C29.3086 14.3516 28.9668 14 28.5273 14ZM28.5273 31.1875C28.9668 31.1875 29.3086 30.8359 29.3086 30.4355V26.9004H27.7363V30.4355C27.7363 30.8359 28.0879 31.1875 28.5273 31.1875Z"
              fill="#6611DD"
            />
          </g>
          <defs>
            <clipPath id="clip0_436_494">
              <rect
                width="18.2324"
                height="18.1348"
                fill="white"
                transform="translate(13 14)"
              />
            </clipPath>
          </defs>
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <circle cx="22" cy="22" r="22" fill="#6611DD" fillOpacity="0.85" />
          <g clipPath="url(#clip0_418_1560)">
            <path
              d="M13 25.3379C13 26.627 14.0547 27.6816 15.3438 27.6816C16.6328 27.6816 17.6973 26.627 17.6973 25.3379C17.6973 24.0488 16.6328 22.9941 15.3438 22.9941C14.0547 22.9941 13 24.0488 13 25.3379ZM14.2012 25.3379C14.2012 24.6934 14.709 24.1953 15.3535 24.1953C15.998 24.1953 16.4961 24.6934 16.4961 25.3379C16.4961 25.9824 15.998 26.4805 15.3535 26.4805C14.709 26.4805 14.2012 25.9824 14.2012 25.3379ZM15.3535 14C14.9141 14 14.5625 14.3516 14.5625 14.791V23.7852H16.1348V14.791C16.1348 14.3516 15.793 14 15.3535 14ZM15.3535 31.1875C15.793 31.1875 16.1348 30.8359 16.1348 30.4355V27.0371H14.5625V30.4355C14.5625 30.8359 14.9141 31.1875 15.3535 31.1875ZM19.582 19.6934C19.582 20.9824 20.6465 22.0371 21.9355 22.0371C23.2246 22.0371 24.2793 20.9824 24.2793 19.6934C24.2793 18.4043 23.2246 17.3496 21.9355 17.3496C20.6465 17.3496 19.582 18.4043 19.582 19.6934ZM20.793 19.6934C20.793 19.0586 21.3008 18.5508 21.9355 18.5508C22.5801 18.5508 23.0781 19.0586 23.0781 19.6934C23.0781 20.3379 22.5801 20.8359 21.9355 20.8359C21.3008 20.8359 20.793 20.3379 20.793 19.6934ZM21.9355 14C21.4961 14 21.1543 14.3516 21.1543 14.752V18.0137H22.7266V14.752C22.7266 14.3516 22.375 14 21.9355 14ZM21.9355 31.1875C22.375 31.1875 22.7266 30.8359 22.7266 30.3965V21.2461H21.1543V30.3965C21.1543 30.8359 21.4961 31.1875 21.9355 31.1875ZM26.1836 25.3379C26.1836 26.627 27.2383 27.6816 28.5273 27.6816C29.8164 27.6816 30.8711 26.627 30.8711 25.3379C30.8711 24.0488 29.8164 22.9941 28.5273 22.9941C27.2383 22.9941 26.1836 24.0488 26.1836 25.3379ZM27.3848 25.3379C27.3848 24.6934 27.8926 24.1953 28.5273 24.1953C29.1816 24.1953 29.6699 24.6934 29.6699 25.3379C29.6699 25.9824 29.1816 26.4805 28.5273 26.4805C27.8926 26.4805 27.3848 25.9824 27.3848 25.3379ZM28.5273 14C28.0879 14 27.7363 14.3516 27.7363 14.791V23.834H29.3086V14.791C29.3086 14.3516 28.9668 14 28.5273 14ZM28.5273 31.1875C28.9668 31.1875 29.3086 30.8359 29.3086 30.4355V26.9004H27.7363V30.4355C27.7363 30.8359 28.0879 31.1875 28.5273 31.1875Z"
              fill="white"
            />
          </g>
          <defs>
            <clipPath id="clip0_418_1560">
              <rect
                width="18.2324"
                height="18.1348"
                fill="white"
                transform="translate(13 14)"
              />
            </clipPath>
          </defs>
        </svg>
      ),
      href: "/dashboard/panel_setting",
      text: "تنظیمات پنل",
    },
    {
      hover_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M21.3793 1.45132C25.3676 1.45132 29.2498 2.63933 32.538 4.86683C35.7414 7.03069 38.2659 10.0855 39.7721 13.6495C42.4026 19.8653 41.7026 26.9721 37.9264 32.5514C35.7626 35.7548 32.7077 38.2793 29.1437 39.7855C22.9279 42.4161 15.8211 41.716 10.2418 37.9399C7.03846 35.776 4.51396 32.7211 3.00775 29.1571C0.377182 22.9414 1.07725 15.8346 4.85339 10.2553C7.01725 7.0519 10.0721 4.5274 13.6361 3.02119C16.0757 1.98169 18.7275 1.45132 21.3793 1.45132ZM21.3793 0.178467C9.66903 0.178467 0.165039 9.68247 0.165039 21.3927C0.165039 33.103 9.66903 42.607 21.3793 42.607C33.0896 42.607 42.5936 33.103 42.5936 21.3927C42.5936 9.68247 33.0896 0.178467 21.3793 0.178467Z"
            fill="white"
            fillOpacity="0.85"
          />
          <path
            d="M3.70898 21.3924C3.70898 28.1598 7.56998 34.3544 13.6797 37.3031L5.23641 14.2009C4.21813 16.4707 3.70898 18.9104 3.70898 21.3924ZM33.3241 20.5014C33.3241 18.3164 32.5392 16.8102 31.8603 15.6222C31.1815 14.4342 30.1208 12.928 30.1208 11.4854C30.1208 10.0429 31.3512 8.34571 33.0908 8.34571H33.3241C26.1325 1.74807 14.9526 2.236 8.35491 9.44886C7.71848 10.1489 7.12448 10.8914 6.61534 11.6764H7.76091C9.60656 11.6764 12.4705 11.443 12.4705 11.443C13.4251 11.3794 13.5312 12.7795 12.5766 12.9068C12.5766 12.9068 11.6219 13.0129 10.5612 13.0765L16.9891 32.2329L20.8501 20.6287L18.0923 13.0765C17.1376 13.0129 16.2466 12.9068 16.2466 12.9068C15.292 12.8431 15.3981 11.4006 16.3527 11.443C16.3527 11.443 19.2803 11.6764 20.9986 11.6764C22.717 11.6764 25.7082 11.443 25.7082 11.443C26.6628 11.3794 26.7689 12.7795 25.8143 12.9068C25.8143 12.9068 24.8596 13.0129 23.7989 13.0765L30.1844 32.0844L32.0088 26.3142C32.815 23.7897 33.3029 22.0076 33.3029 20.4802L33.3241 20.5014ZM21.6775 22.9199L16.3739 38.3426C19.9379 39.3821 23.7353 39.2973 27.2356 38.0669L27.1083 37.8335L21.6775 22.9199ZM36.8881 12.9068C36.973 13.5008 37.0154 14.116 37.0154 14.7312C37.0154 16.5344 36.676 18.5497 35.6789 21.053L30.2693 36.6667C38.5428 31.8511 41.4916 21.3076 36.8881 12.9068Z"
            fill="white"
            fillOpacity="0.85"
          />
        </svg>
      ),
      out_icon: (
        <svg
          width="44"
          height="44"
          viewBox="0 0 44 44"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M21.3798 1.45126C25.3681 1.45126 29.2503 2.63927 32.5385 4.86677C35.7418 7.03063 38.2663 10.0855 39.7726 13.6495C42.4031 19.8652 41.7031 26.972 37.9269 32.5514C35.7631 35.7547 32.7082 38.2792 29.1442 39.7854C22.9284 42.416 15.8216 41.7159 10.2423 37.9398C7.03895 35.7759 4.51445 32.7211 3.00823 29.1571C0.37767 22.9413 1.07774 15.8345 4.85388 10.2552C7.01773 7.05184 10.0726 4.52734 13.6366 3.02113C16.0762 1.98163 18.728 1.45126 21.3798 1.45126ZM21.3798 0.178406C9.66952 0.178406 0.165527 9.68241 0.165527 21.3927C0.165527 33.1029 9.66952 42.6069 21.3798 42.6069C33.0901 42.6069 42.5941 33.1029 42.5941 21.3927C42.5941 9.68241 33.0901 0.178406 21.3798 0.178406Z"
            fill="#510EB1"
            fillOpacity="0.85"
          />
          <path
            d="M3.70898 21.3923C3.70898 28.1597 7.56998 34.3542 13.6797 37.303L5.23641 14.2007C4.21813 16.4706 3.70898 18.9102 3.70898 21.3923ZM33.3241 20.5013C33.3241 18.3162 32.5392 16.81 31.8603 15.6221C31.1815 14.4341 30.1208 12.9279 30.1208 11.4853C30.1208 10.0427 31.3512 8.34559 33.0908 8.34559H33.3241C26.1325 1.74795 14.9526 2.23588 8.35491 9.44873C7.71848 10.1488 7.12448 10.8913 6.61534 11.6762H7.76091C9.60656 11.6762 12.4705 11.4429 12.4705 11.4429C13.4251 11.3792 13.5312 12.7794 12.5766 12.9067C12.5766 12.9067 11.6219 13.0127 10.5612 13.0764L16.9891 32.2328L20.8501 20.6286L18.0923 13.0764C17.1376 13.0127 16.2466 12.9067 16.2466 12.9067C15.292 12.843 15.3981 11.4004 16.3527 11.4429C16.3527 11.4429 19.2803 11.6762 20.9986 11.6762C22.717 11.6762 25.7082 11.4429 25.7082 11.4429C26.6628 11.3792 26.7689 12.7794 25.8143 12.9067C25.8143 12.9067 24.8596 13.0127 23.7989 13.0764L30.1844 32.0843L32.0088 26.314C32.815 23.7895 33.3029 22.0075 33.3029 20.4801L33.3241 20.5013ZM21.6775 22.9197L16.3739 38.3425C19.9379 39.382 23.7353 39.2972 27.2356 38.0667L27.1083 37.8334L21.6775 22.9197ZM36.8881 12.9067C36.973 13.5007 37.0154 14.1159 37.0154 14.7311C37.0154 16.5342 36.676 18.5496 35.6789 21.0529L30.2693 36.6666C38.5428 31.851 41.4916 21.3075 36.8881 12.9067Z"
            fill="#510EB1"
            fillOpacity="0.85"
          />
        </svg>
      ),
      href: "/dashboard/connect_to_wordpress",
      text: "اتصال به وردپرس",
    },
    // {
    //   hover_icon: (
    //     <>
    //       <Webhook />
    //     </>
    //   ),
    //   out_icon: <></>,
    //   href: "/dashboard/create_site",
    //   text: "ساخت سایت",
    // },
    {
      hover_icon: <></>,
      out_icon: <></>,
      href: "/dashboard/cooperation_in_sales",
      text: "همکاری در فروش",
    },
  ];

  const pathname = usePathname(); // Get the current path
  const [hover, setHover] = useState<number>(-1);
  const [ping, setPing] = useState(0);
  const [secondsLeft, setSecondsLeft] = useState("30");

  const { user, setUser, loadingAuth } = useAuth();
  const { isLoading, startLoading, stopLoading } = useLoading();
  const { sendEvent, receiverEvent } = useSocketRequest();
  const { isDisconnect } = useSocket();
  const { addAlert, linkController, addLink, removeLink } = useController();

  useEffect(() => {
    receiverEvent("logoutEventReceiver", (data) => {
      stopLoading();

      if (!data.success) {
        addAlert(data.message, "error");
        return;
      }

      setUser(null);
    });
  }, []);

  // useEffect(() => {
  //   const interval = setInterval(() => {
  //     const startTime = Date.now();

  //     sendEvent("ping", {});

  //     socket.once("pong", () => {
  //       const endTime = Date.now();
  //       const calculatedPing = endTime - startTime;
  //       setPing(calculatedPing);
  //     });
  //   }, 1000);

  //   return () => clearInterval(interval);
  // }, []);

  useEffect(() => {
    removeLink("panel_setting");
    removeLink("support");
    removeLink("management_of_user");
    removeLink("course");
    removeLink("send_message");
    removeLink("cooperation");

    switch (pathname) {
      case "/dashboard/panel_setting/sms_system":
        return addLink("تنظیمات پیامکی", "panel_setting");

      case "/dashboard/panel_setting/general_settings":
        return addLink("تنظیمات اطلاعات عمومی", "panel_setting");

      case "/dashboard/support/ai_support":
        return addLink("پشتیبانی هوش مصنوعی", "support");

      case "/dashboard/support/manual_support":
        return addLink("پشتیبانی دستی", "support");

      case "/dashboard/management_users/send_message":
        return addLink("ارسال پیام", "send_message");

      case "/dashboard/cooperation_in_sales/active_course":
        return addLink("دوره های فعال", "cooperation");
    }
  }, [pathname]);

  // useEffect(() => {
  //   if (isDisconnect || secondsLeft <= 0) {
  //     return;
  //   }

  //   const timer = setInterval(() => {
  //     setSecondsLeft((prev) => prev - 1);
  //   }, 1000);

  //   return () => clearInterval(timer);
  // }, [secondsLeft, isDisconnect]);

  useEffect(() => {
    sendEvent("startTimer", {});

    receiverEvent("timer", (data) => {
      setSecondsLeft(data.remainingTime);
    });
  }, []);

  const handleSubmit = useCallback(() => {
    if (!user) return;

    startLoading();
    sendEvent("logout", { userId: user.userId });
  }, [user]);

  return (
    <div className="flex flex-row overflow-hidden w-full h-[100vh] border-black/10 bg-[#F5EEFF]">
      <section className="w-[25%]">
        <aside className="w-full">
          <div className="flex justify-end mt-5">
            <div className="flex items-center justify-center w-full object-cover">
              <Image
                src="/logo.png"
                className="rounded-full"
                alt="icon"
                width={314}
                height={70}
                loading="lazy"
              />
            </div>
          </div>

          <ScrollArea
            dir="rtl"
            className="w-full overflow-auto h-[90vh] flex flex-col items-center mt-3 gap-1"
          >
            {buttons.map((item, index) => {
              return (
                <div
                  className="mt-2 flex items-center justify-center w-full"
                  key={index}
                >
                  <DashboardButton
                    isLoading={isDisconnect || loadingAuth}
                    disabled={isDisconnect}
                    start_icon={
                      hover === index ||
                      (item.href === "/dashboard"
                        ? pathname === item.href
                        : pathname.startsWith(item.href))
                        ? item.hover_icon
                        : item.out_icon
                    }
                    end_icon={
                      <>
                        {(item.href === "/dashboard"
                          ? pathname === item.href
                          : pathname.startsWith(item.href)) ||
                        hover === index ? (
                          <>
                            <svg
                              width="16"
                              height="15"
                              viewBox="0 0 16 15"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <g clipPath="url(#clip0_65_500)">
                                <path
                                  d="M0 10.9695C0 11.6006 0.487497 12.0889 1.06972 12.0889C1.65018 12.0889 2.11737 11.5818 2.11737 10.9998V7.34786L1.95741 3.3076L3.5371 5.09334L12.8467 14.3994C13.0779 14.6289 13.3455 14.7387 13.6166 14.7387C14.1998 14.7387 14.7209 14.2078 14.7209 13.6424C14.7209 13.3695 14.5969 13.0957 14.3754 12.8725L5.07556 3.55488L3.29958 1.98945L7.50625 2.13339H10.9838C11.5658 2.13339 12.0648 1.66445 12.0648 1.09375C12.0648 0.521292 11.6041 0.0257874 10.9553 0.0257874H1.14687C0.448434 0.0257874 0.00625014 0.491995 0.00625014 1.16465L0 10.9695Z"
                                  fill="white"
                                  fillOpacity="0.85"
                                />
                              </g>
                              <defs>
                                <clipPath id="clip0_65_500">
                                  <rect
                                    width="15.0805"
                                    height="14.7387"
                                    fill="white"
                                  />
                                </clipPath>
                              </defs>
                            </svg>
                          </>
                        ) : (
                          <>
                            <svg
                              width="16"
                              height="15"
                              viewBox="0 0 16 15"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <g clipPath="url(#clip0_65_500)">
                                <path
                                  d="M0 10.9695C0 11.6006 0.487497 12.0889 1.06972 12.0889C1.65018 12.0889 2.11737 11.5818 2.11737 10.9998V7.34786L1.95741 3.3076L3.5371 5.09334L12.8467 14.3994C13.0779 14.6289 13.3455 14.7387 13.6166 14.7387C14.1998 14.7387 14.7209 14.2078 14.7209 13.6424C14.7209 13.3695 14.5969 13.0957 14.3754 12.8725L5.07556 3.55488L3.29958 1.98945L7.50625 2.13339H10.9838C11.5658 2.13339 12.0648 1.66445 12.0648 1.09375C12.0648 0.521292 11.6041 0.0257874 10.9553 0.0257874H1.14687C0.448434 0.0257874 0.00625014 0.491995 0.00625014 1.16465L0 10.9695Z"
                                  fill="#6611DD"
                                  fillOpacity="0.85"
                                />
                              </g>
                              <defs>
                                <clipPath id="clip0_65_500">
                                  <rect
                                    width="15.0805"
                                    height="14.7387"
                                    fill="white"
                                  />
                                </clipPath>
                              </defs>
                            </svg>
                          </>
                        )}
                      </>
                    }
                    text={item.text}
                    href={item.href}
                    className={{
                      className: `${
                        buttons.length === index + 1 ? "mb-9" : ""
                      } ${
                        (
                          item.href === "/dashboard"
                            ? pathname === item.href
                            : pathname.startsWith(item.href)
                        )
                          ? "bg-[#7D35E2]"
                          : "bg-white hover:bg-[#955AE8] hover:text-white"
                      }`,
                      endIconClassName: `${
                        (
                          item.href === "/dashboard"
                            ? pathname === item.href
                            : pathname.startsWith(item.href)
                        )
                          ? "text-white"
                          : ""
                      }`,
                      textClassName: `${
                        (
                          item.href === "/dashboard"
                            ? pathname === item.href
                            : pathname.startsWith(item.href)
                        )
                          ? "text-white"
                          : ""
                      }`,
                      startIconClassName: `${
                        (
                          item.href === "/dashboard"
                            ? pathname === item.href
                            : pathname.startsWith(item.href)
                        )
                          ? "text-black"
                          : ""
                      }`,
                    }}
                    // onClick={() => setHover(index)}
                    onMouseOut={() => setHover(-1)}
                    onMouseOver={() => setHover(index)}
                  />
                </div>
              );
            })}
          </ScrollArea>
        </aside>
      </section>

      <section className="flex flex-col items-center justify-center w-[75%]">
        <header className="w-full h-[80px] flex items-center justify-between p-5">
          <section className="flex gap-5 w-full">
            <MainLayoutHeader />
          </section>

          <section>
            <div>
              <Button
                variant={"ghost"}
                className="flex items-center justify-center gap-2 text-[18px] focus-visible:bg-transparent hover:bg-transparent hover:text-red-500"
                onClick={handleSubmit}
                type="button"
                disabled={isLoading || isDisconnect}
              >
                خروج از حساب
              </Button>
            </div>
          </section>
        </header>

        <MainLayoutBody>
          <main className="w-full h-full flex flex-col items-center rounded-tr-[37px] bg-white">
            <section
              slot="top"
              className="h-[10vh] w-[95%] flex items-center p-2"
            >
              <div className="flex items-center w-[50%] h-[10vh] ml-auto mr-auto text-xl font-semibold">
                <span className="flex items-center justify-center">
                  پنل ناشر <BsArrowLeft className="ml-2 mr-2" size={20} />{" "}
                  <span>
                    {buttons
                      .sort((a, b) => b.href.length - a.href.length)
                      .find((button) => pathname.startsWith(button.href))
                      ?.text || ""}
                  </span>
                  {linkController.map((item, index) => {
                    return (
                      <span
                        key={index}
                        className="flex items-center justify-center"
                      >
                        <BsArrowLeft className="ml-2 mr-2" size={20} />{" "}
                        {item.link}
                      </span>
                    );
                  })}
                </span>
              </div>

              <div className="w-[50%] flex items-center justify-end">
                <p
                  dir="ltr"
                  className={`${
                    secondsLeft === "0" ? "text-red-600" : "text-black"
                  } flex items-center justify-center gap-3 text-xl font-semibold`}
                >
                  {secondsLeft}{" "}
                </p>
              </div>
            </section>

            <section
              className={`w-[95%] h-[77vh] relative mt-1.5`}
              slot="main"
              suppressHydrationWarning
            >
              {isDisconnect && (
                <div
                  className={`fixed z-50 flex items-center justify-center ${
                    pathname === "/dashboard/create_site"
                      ? "bg-black/90 w-full h-full top-0 left-0"
                      : "left-0 top-[10vh] w-[75%] h-[90vh]"
                  }`}
                >
                  <div
                    className="bg-red-800/95 text-white text-2xl rounded-2xl shadow-lg p-5"
                    dir="ltr"
                  >
                    <p className="flex justify-center gap-3 animate-pulse">
                      connecting network <Wifi size={27} />
                    </p>
                  </div>
                </div>
              )}

              <div
                className={`h-[100%] w-full inset-0 ${
                  isDisconnect && pathname !== "/dashboard/create_site"
                    ? "opacity-50"
                    : isDisconnect && pathname === "/dashboard/create_site"
                    ? ""
                    : ""
                }`}
              >
                {children}
              </div>
            </section>
          </main>
        </MainLayoutBody>
      </section>
    </div>
  );
}
